// pages/order/express/index.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    logisticsData: [
      {
        content: '您的订单正在派送中',
        time: '2020-01-11 00:00:00'
      },
      {
        content: '您的订单已达到广东省深圳市福田区新洲广东省深圳市福田区新洲广东省深圳市福田区',
        time: '2020-01-11 00:00:00'
      },
      {
        content: '您的订单正在路上飞奔',
        time: '2020-01-11 00:00:00'
      },
      {
        content: '您的订单已出库',
        time: '2020-01-11 00:00:00'
      },
      {
        content: '您的订单正在出库中',
        time: '2020-01-11 00:00:00'
      },
      {
        content: '您的订单已提交',
        time: '2020-01-11 00:00:00'
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})